/*---------------------------------------------------------------------------**
Copyright (C) 2004-2009 ACUTElogic Corp.
ACUTElogic Confidential. All rights reserved.

    <<<<< comply with MISRA standard. >>>>>
**---------------------------------------------------------------------------**
$HeadURL: http://localhost:50120/sdc/svn/Al_colorGr/Projects/HscCore/trunk/Src/Private/Hsc/Include/AlHsc.h $
$LastChangedDate:: 2012-11-26 14:28:21 #$
$LastChangedRevision: 2708 $
$LastChangedBy: seino $
**------------------------------------------------------------------------*//**
ASC Main codes
    @file   
    @author 
    @date   
    @note   
*//*-------------------------------------------------------------------------*/

#ifndef	  AL_HSC_H
#define	  AL_HSC_H

/*=============================================================================
	Include
==============================================================================*/

// public
#include	"AlHscLib.h"
// private
#include	"AlHscCtrlBlock.h"

/*=============================================================================
	Macro
==============================================================================*/
//---------------------------------------------------------------------------**
//	AL-ASC Configuration
//---------------------------------------------------------------------------**
#define AL_HSC_DSI
//#define AL_HSC_HSC

// 補正テーブルに落書きする機能（DSI専用でもない）
#define AL_HSC_DSI_DEBUG

//---------------------------------------------------------------------------**
//	全般
//---------------------------------------------------------------------------**
#define AL_HSC_INVALID_ID			(0xFFFFFFFF)

// Setupコール時にリクエスト履歴に格納するフラグ値
#define AL_HSC_REQ_LIB_SETUP		(0xFFFFFFFF)
// リクエスト履歴を取得するためのリクエストID(for DEBUG)
#define AL_HSC_REQ_GET_REQ_HISTORY	(0xFFFF)

// エラーコード
#define AL_HSC_ERR_NONE						(0x00000000)
#define AL_HSC_ERR_SETUP_NOT_CALLED			(0xFFFFFFFF)
#define AL_HSC_ERR_CB_UNINITIALIZED			(0x80000001)
#define AL_HSC_ERR_CB_NOT_OPENED			(0x80000002)
#define AL_HSC_ERR_CANNOT_EXEC_ASC_MAIN		(0x80000003)
#define AL_HSC_ERR_DSI_DST_TBL_NOT_FOUND	(0x80000004)
#define AL_HSC_ERR_PARAM_NOT_ENOUGH			(0x80000005)

//---------------------------------------------------------------------------**
//	for PC debug
//---------------------------------------------------------------------------**
#ifdef WIN32
	// 単体テストを行うために、ファイルスコープの関数をグローバルにする
	#ifdef PRIVATE
		#undef PRIVATE
		#define PRIVATE
	#endif
#endif

/*=============================================================================
	Typedef
==============================================================================*/
/*=============================================================================
	Prototype
==============================================================================*/
extern void		AlHscSetErrorCode(
				UI_32 *						ppiBuf		,	// [I] Work buffer
				UI_32						puiCode		);	// [I] Error Code
/*=============================================================================
	Variable
==============================================================================*/

//==================================================================== EOF ==**
#endif	// AL_HSC_H
